/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_gamewon.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bamagere <bamagere@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/01/14 12:25:31 by bamagere          #+#    #+#             */
/*   Updated: 2026/01/14 12:36:45 by bamagere         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
#include "../printfs/my_printfs.h"

void	ft_gamewon(void)
{
	ft_printf("%s\n", NC);
	ft_printf("%s╔════════════════════════════════════════╗\n", BOLD_Y);
	ft_printf("%s║%s║%s\t╔═╗╔═╗╔╦╗╔═╗", BOLD_MAG, CYAN, FLASH_Y);
	ft_printf("  ╦    ╦╔═╗╔╗ ╦\t%s║%s║\n", CYAN, BOLD_Y);
	ft_printf("%s║%s║%s\t║ ╦╠═╣║║║║╣ ", BOLD_MAG, CYAN, FLASH_C);
	ft_printf("  ╚╗╔╗╔╝║ ║║╚╗║\t%s║%s║\n", CYAN, BOLD_Y);
	ft_printf("%s║%s║%s\t╚═╝╩ ╩╩ ╩╚═╝", BOLD_MAG, CYAN, FLASH_MAG);
	ft_printf("   ╚╝╚╝ ╚═╝╩ ╚╝\t%s║%s║\n", CYAN, BOLD_Y);
	ft_printf("%s╚════════════════════════════════════════╝\n", BOLD_MAG);
	ft_printf("%s\n", NC);
}
