/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_gameover.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bamagere <bamagere@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/01/14 11:53:30 by bamagere          #+#    #+#             */
/*   Updated: 2026/01/14 14:34:20 by bamagere         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
#include "../printfs/my_printfs.h"

void	ft_gameover(void)
{
	ft_printf("%s\n", NC);
	ft_printf("%s╔════════════════════════════════════════╗\n", BOLD_Y);
	ft_printf("%s║%s║%s\t╔═╗╔═╗╔╦╗╔═╗", BOLD_MAG, CYAN, FLASH_Y);
	ft_printf("  ╔═╗╦  ╦╔═╗╦═╗\t%s║%s║\n", CYAN, BOLD_Y);
	ft_printf("%s║%s║%s\t║ ╦╠═╣║║║║╣", BOLD_MAG, CYAN, FLASH_C);
	ft_printf("   ║ ║╚╗╔╝║╣ ╠╦╝\t%s║%s║\n", CYAN, BOLD_Y);
	ft_printf("%s║%s║%s\t╚═╝╩ ╩╩ ╩╚═╝", BOLD_MAG, CYAN, FLASH_MAG);
	ft_printf("  ╚═╝ ╚╝ ╚═╝╩╚═\t%s║%s║\n", CYAN, BOLD_Y);
	ft_printf("%s╚════════════════════════════════════════╝\n", BOLD_MAG);
	ft_printf("%s\n", NC);
}
